package ex06;

public class ObjectEx04 {

	public static void main(String[] args) {
		  String book = "1965년 대한민국 부산에서 태어났다. 1982년에 혜광고등학교를 졸업하고, 그해 3월 서울대 법대에 입학하였다. 당시 만 16세 11개월의 나이로 최연소 입학인 점에서 화제가 되었다. 서울대 재학 중에는 법과대학 언론/학술지 〈FIDES〉의 편집장을 맡았으며, 학생운동에 참여하였다. 서울대학교 졸업 후 캘리포니아 대학교 버클리에서 LLM 및 SJD 학위를 받았다. 1989년에서 1990년까지 석사장교로 군복무를 마친 후, 1992년 3월 울산대학교 법학과에서 교수 생활을 시작하였다.\r\n" + 
		  		"\r\n" + 
		  		"울산대에서 법학과 교수로 임명된 해, 남한사회주의노동자동맹 사건에 연루되어 국가보안법 위반으로 구속됐다. 당시 고향 및 대학 선배인 백태웅과 박노해 시인이 이끄는 사회주의노동자동맹을 도운 혐의로 반 년간 수감됐고, 징역 1년 집행유예 2년을 선고받은 이후인 1994년 \"불공정한 재판을 받았거나 가혹행위를 받은 정치범 및 양심수\"로 사노맹 관련자들을 포함시키면서 조국에 대해 그 해 '올해의 양심수'로 지정하였다.[4] 은수미 전 의원도 대학교 동기로 당시 같이 활동한 것으로 전한다. 재판 당시 천정배 변호사가 그의 변호인단을 이끌었으며 제1심 재판장은 김황식 전 국무총리였다. 훗날 조국 교수는 저서 '양심과 사상의 자유를 위하여'에서 \"국가보안법은 세계 어디에도 없는 시대착오적이며 유례없는 법률\"이라고 말한 바 있다.[5]\r\n" + 
		  		"\r\n" + 
		  		"2000년에는 동국대학교 교수를 거쳐 2001년 12월 이후 서울대학교 교수에 재직하였다.[4]\r\n" + 
		  		"\r\n" + 
		  		"\r\n" + 
		  		"새정치민주연합 혁신위원 시절\r\n" + 
		  		"1998년 영국 옥스퍼드 대학교와 리즈 대학교에서 방문학자로 연구하였고 2005년부터 2006년까지 미국의 하버드-옌칭 연구소에서 방문학자로 연구하였다. 2000년 이후 참여연대의 사법감시센터 (부)소장, 부운영위원장으로 시민운동에 참여하였고 2007년부터 2008년까지 서울대학교 대외협력 부본부장을 역임하였으며 2007년 12월 국가인권위원회 위원으로 임명되었다(대법원장 추천).[6] 2009년 이후 대법원 제2기 양형위원회 위원으로 활동했고[7] 한국형사법학회, 한국형사정책학회, 한국비교형사법학회, 한국피해자학회 등 여러 학회의 상임이사이며, 2013년 한국경찰법학회 회장, 2015년 한국형사정책학회 부회장 등을 역임했다.\r\n" + 
		  		"\r\n" + 
		  		"정계 활동\r\n" + 
		  		"2011년 성남시 분당구 을 지역구 국회의원 보궐선거의 민주당 후보로 제안받았으나 거절했다.[8] 이후 2012년 대한민국 제19대 국회의원 선거에서 민주통합당의 공천심사위원장을 제안받았지만 다시 한번 거절하였다.[9] 2014년에도 서울시 교육감 출마설이 제기되자, 의사와 능력이 없다고 선언하였다.[10] 2017년 5월 11일, 문재인 정부 초대 민정수석으로 임명되었고,[11] 2019년 7월 26일 퇴임하였다.[12] 8월 9일 문재인 대통령은 조국을 법무부 장관 후보로 지명되었으나[13] 딸의 대학 입학과 관련한 문제와 가족 소유의 웅동학원 등으로 인하여 사퇴 요구를 받았으나 검찰개혁 입장을 밝히며 \"청문회에서 의혹에 대해 해명하겠다\"고 밝혔다.\r\n" + 
		  		"\r\n" + 
		  		"학력";
		  
		  System.out.println(book.hashCode());
		  
		  String book2 = "1965년 대한민국 부산에서 태어났다. 1982년에 혜광고등학교를 졸업하고, 그해 3월 서울대 법대에 입학하였다. 당시 만 16세 11개월의 나이로 최연소 입학인 점에서 화제가 되었다. 서울대 재학 중에는 법과대학 언론/학술지 〈FIDES〉의 편집장을 맡았으며, 학생운동에 참여하였다. 서울대학교 졸업 후 캘리포니아 대학교 버클리에서 LLM 및 SJD 학위를 받았다. 1989년에서 1990년까지 석사장교로 군복무를 마친 후, 1992년 3월 울산대학교 법학과에서 교수 생활을 시작하였다.\r\n" + 
		  		"\r\n" + 
		  		"울산대에서 법학과 교수로 임명된 해, 남한사회주의노동자동맹 사건에 연루되어 국가보안법 위반으로 구속됐다. 당시 고향 및 대학 선배인 백태웅과 박노해 시인이 이끄는 사회주의노동자동맹을 도운 혐의로 반 년간 수감됐고, 징역 1년 집행유예 2년을 선고받은 이후인 1994년 \"불공정한 재판을 받았거나 가혹행위를 받은 정치범 및 양심수\"로 사노맹 관련자들을 포함시키면서 조국에 대해 그 해 '올해의 양심수'로 지정하였다.[4] 은수미 전 의원도 대학교 동기로 당시 같이 활동한 것으로 전한다. 재판 당시 천정배 변호사가 그의 변호인단을 이끌었으며 제1심 재판장은 김황식 전 국무총리였다. 훗날 조국 교수는 저서 '양심과 사상의 자유를 위하여'에서 \"국가보안법은 세계 어디에도 없는 시대착오적이며 유례없는 법률\"이라고 말한 바 있다.[5]\r\n" + 
		  		"\r\n" + 
		  		"2000년에는 동국대학교 교수를 거쳐 2001년 12월 이후 서울대학교 교수에 재직하였다.[4]\r\n" + 
		  		"\r\n" + 
		  		"\r\n" + 
		  		"새정치민주연합 혁신위원 시절\r\n" + 
		  		"1998년 영국 옥스퍼드 대학교와 리즈 대학교에서 방문학자로 연구하였고 2005년부터 2006년까지 미국의 하버드-옌칭 연구소에서 방문학자로 연구하였다. 2000년 이후 참여연대의 사법감시센터 (부)소장, 부운영위원장으로 시민운동에 참여하였고 2007년부터 2008년까지 서울대학교 대외협력 부본부장을 역임하였으며 2007년 12월 국가인권위원회 위원으로 임명되었다(대법원장 추천).[6] 2009년 이후 대법원 제2기 양형위원회 위원으로 활동했고[7] 한국형사법학회, 한국형사정책학회, 한국비교형사법학회, 한국피해자학회 등 여러 학회의 상임이사이며, 2013년 한국경찰법학회 회장, 2015년 한국형사정책학회 부회장 등을 역임했다.\r\n" + 
		  		"\r\n" + 
		  		"유치원 활동\r\n" + 
		  		"2011년 성남시 분당구 을 지역구 국회의원 보궐선거의 민주당 후보로 제안받았으나 거절했다.[8] 이후 2012년 대한민국 제19대 국회의원 선거에서 민주통합당의 공천심사위원장을 제안받았지만 다시 한번 거절하였다.[9] 2014년에도 서울시 교육감 출마설이 제기되자, 의사와 능력이 없다고 선언하였다.[10] 2017년 5월 11일, 문재인 정부 초대 민정수석으로 임명되었고,[11] 2019년 7월 26일 퇴임하였다.[12] 8월 9일 문재인 대통령은 조국을 법무부 장관 후보로 지명되었으나[13] 딸의 대학 입학과 관련한 문제와 가족 소유의 웅동학원 등으로 인하여 사퇴 요구를 받았으나 검찰개혁 입장을 밝히며 \"청문회에서 의혹에 대해 해명하겠다\"고 밝혔다.\r\n" + 
		  		"\r\n" + 
		  		"학력";
		  
		  System.out.println(book2.hashCode());

	}

}
